In [1]:
import pandas as pd

In [2]:
dictionary = {'Autores': ['Rick', 'Tolkien', 'Rick', 'Assis'],
              'Títulos': ['Raios','Anel','Montros','Memórias'],
              'Preços': [41.2,35.7,39.5,40.5]}

In [3]:
df = pd.DataFrame(dictionary)

df

   Autores   Títulos  Preços
0     Rick     Raios    41.2
1  Tolkien      Anel    35.7
2     Rick   Montros    39.5
3    Assis  Memórias    40.5

In [4]:
df['Autores']

0       Rick
1    Tolkien
2       Rick
3      Assis
Name: Autores, dtype: object

In [5]:
df['Autores'][1]

'Tolkien'

In [6]:
df['Preços'].mean()

39.225

In [7]:
mascara = df["Autores"] == 'Rick'

print(mascara)

0     True
1    False
2     True
3    False
Name: Autores, dtype: bool

In [8]:
df[mascara]

  Autores  Títulos  Preços
0    Rick    Raios    41.2
2    Rick  Montros    39.5

In [9]:
new_dict = {'Autores': 'Rick', 'Títulos': 'Titã','Preços': 36.50}

df.loc[len(df)] = new_dict #Jeito simples de adicionar

df

   Autores   Títulos  Preços
0     Rick     Raios    41.2
1  Tolkien      Anel    35.7
2     Rick   Montros    39.5
3    Assis  Memórias    40.5
4     Rick      Titã    36.5

In [17]:
new_dict = {'Autores': 'Rick', 'Títulos': 'Titã','Preços': 36.50}
new_data = pd.DataFrame(new_dict, index = [0])

new_data

  Autores Títulos  Preços
0    Rick    Titã    36.5

In [26]:
df = (pd.concat([df, new_data], ignore_index=True)) #Jeito difícil de adicionar

df

   Autores   Títulos  Preços
0     Rick     Raios    41.2
1  Tolkien      Anel    35.7
2     Rick   Montros    39.5
3    Assis  Memórias    40.5
4     Rick      Titã    36.5
5     Rick      Titã    36.5
6     Rick      Titã    36.5
7     Rick      Titã    36.5

In [28]:
mascara_correcao = df["Títulos"] == "Anel"

print(mascara_correcao)

0    False
1     True
2    False
3    False
4    False
5    False
6    False
7    False
Name: Títulos, dtype: bool

In [29]:
df.loc[mascara_correcao, 'Títulos'] = "Anéis"

df

   Autores   Títulos  Preços
0     Rick     Raios    41.2
1  Tolkien     Anéis    35.7
2     Rick   Montros    39.5
3    Assis  Memórias    40.5
4     Rick      Titã    36.5
5     Rick      Titã    36.5
6     Rick      Titã    36.5
7     Rick      Titã    36.5